profile_register = '🔑 Зарегистрироваться'
hunting_request = '🎯 Подать заявку на охоту'
wh_content = '🎬 Контент Wild-Hunter'
settings = '⚙️ Настройки'
hunter_role_select = '🦌 Войти как охотник'
hunting_base_role_select = '🏕️ Войти как представитель базы'
main_menu_btn = '🏠 В меню'
log_out = '🚪 Выйти из аккаунта'

hunt_group_request = '📨 Подать заявку на вступление'
hunt_group_answers = '🔔 Уведомления о заявке'
hunt_group_join = '🤝 Присоединиться'
request_confirmed = '✅ Подтверждено'

wh_tg_channel_subscribe = '📢 Подписаться на канал'
wh_media_content = '🎥 Медиа'
wh_media_vk = '📼 VK видео'
wh_media_youtube = '🎬 YouTube видео'

confirm_btn = "✅ Подтвердить"
# ============== reply кнопки ===============
skip_btn = "➡️ Пропустить"
step_back_btn = "⬅️ Назад"
home_btn = "🏠 Вернуться к началу"
share_phone_number_btn = "📲 Поделиться контактом"
next_btn = "➡️ Далее"
share_email_btn = '📧 Поделиться почтой'
region_btn = '🗺️ Выбрать регион'


regions_list = [
    "Республика Адыгея",
    "Республика Башкортостан",
    "Республика Бурятия",
    "Республика Алтай",
    "Республика Дагестан",
    "Республика Ингушетия",
    "Кабардино-Балкарская Республика",
    "Республика Калмыкия",
    "Карачаево-Черкесская Республика",
    "Республика Карелия",
    "Республика Коми",
    "Республика Марий Эл",
    "Республика Мордовия",
    "Республика Саха (Якутия)",
    "Республика Северная Осетия — Алания",
    "Республика Татарстан",
    "Республика Тыва",
    "Удмуртская Республика",
    "Республика Хакасия",
    "Чеченская Республика",
    "Чувашская Республика",

    "Алтайский край",
    "Забайкальский край",
    "Камчатский край",
    "Краснодарский край",
    "Красноярский край",
    "Пермский край",
    "Приморский край",
    "Ставропольский край",
    "Хабаровский край",

    "Амурская область",
    "Архангельская область",
    "Астраханская область",
    "Белгородская область",
    "Брянская область",
    "Владимирская область",
    "Волгоградская область",
    "Вологодская область",
    "Воронежская область",
    "Ивановская область",
    "Иркутская область",
    "Калининградская область",
    "Калужская область",
    "Кемеровская область",
    "Кировская область",
    "Костромская область",
    "Курганская область",
    "Курская область",
    "Ленинградская область",
    "Липецкая область",
    "Магаданская область",
    "Московская область",
    "Мурманская область",
    "Нижегородская область",
    "Новгородская область",
    "Новосибирская область",
    "Омская область",
    "Оренбургская область",
    "Орловская область",
    "Пензенская область",
    "Псковская область",
    "Ростовская область",
    "Рязанская область",
    "Самарская область",
    "Саратовская область",
    "Сахалинская область",
    "Свердловская область",
    "Смоленская область",
    "Тамбовская область",
    "Тверская область",
    "Томская область",
    "Тульская область",
    "Тюменская область",
    "Ульяновская область",
    "Челябинская область",
    "Ярославская область",

    "Москва",
    "Санкт-Петербург",
    "Севастополь",

    "Еврейская автономная область",

    "Ненецкий автономный округ",
    "Ханты-Мансийский автономный округ — Югра",
    "Чукотский автономный округ",
    "Ямало-Ненецкий автономный округ",

    "Донецкая Народная Республика",
    "Луганская Народная Республика",
    "Запорожская область",
    "Херсонская область"
]

hunting_types_list = [
    "Индивидуальная",
    "Коллективная",
]

hunting_base_services = [
    "Охота с егерем",
    "Аренда оружия",
    "Размещение",
    "Питание",
    "Баня",
    "Разделка трофеев",
    "Рыбалка",
    "Аренда техники",
    "Фотоохота",
    "Экскурсии",
    "Таксидермия",
    "Продажа дичи",
    "Парковка",
    "Охрана"
]