profile_register = '🔑 Зарегистрироваться'
hunting_request = '🎯 Подать заявку на охоту'
wh_content = '🎬 Контент Wild-Hunter'
settings = '⚙️ Настройки'
hunter_role_select = 'Стать охотником'
hunting_base_role_select = 'Стать охотхозяйством'
main_menu_btn = '🏠 В меню'
log_out = 'Выйти из аккаунта'


# ============== reply кнопки ===============
skip_btn = "➡️ Пропустить"
step_back_btn = "⬅️ Назад"
home_btn = "🏠 Вернуться к началу"
share_phone_number_btn = "📲 Поделиться контактом"
confirm_register_btn = "✅ Подтвердить"
next_btn = "➡️ Далее"
share_email_btn = 'Поделиться почтой'
region_btn = 'Выбрать регион'


regions_list = [
    "Адыгея",
    "Алтай",
    "Башкортостан",
    "Бурятия",
    "Дагестан",
    "Ингушетия",
    "Кабардино-Балкарская",
    "Калмыкия",
    "Карелия",
    "Коми",
    "Крым",
    "Марий Эл",
    "Мордовия",
    "Саха (Якутия)",
    "Северная Осетия – Алания",
    "Татарстан",
    "Тыва",
    "Удмуртская",
    "Хакасия",
    "Чеченская",
    "Чувашская",
    "Карачаево-Черкесская",
]

hunting_types_list = [
    'Охота на вампиров',
    'Охота на птиц'
]
