from core.texts import links_texts

role_selection = 'Вы охотник или охотхозяйство? 🐾'
start_command_hello = '🌄 Отличное время для охоты, не так ли? Добро пожаловать на Wild-Hunter!'
main_menu_answer = '📋 Выберите раздел:'
main_menu_clean = '🏠 Главное меню'
hunter_role_about = '🏆 Отлично, вы охотник! \n\nВы можете зарегистрироваться и организовать новую коллективную или индивидуальную охоту.'
hunting_role_role_about = '🏚 Отлично, вы представитель охотхозяйства! \n\nВы можете зарегистрироваться в соответствующем разделе.'
main_settings = '⚙️ Настройки'
successful_user_deletion = '🚪 Вы вышли из аккаунта'

hunt_group_join = '🤝 Присоединяйтесь к охоте!'
hunt_group_request = '🎯 Здесь вы можете подать заявку на охоту'
unregister_hunter = '❌ Вы не зарегистрированы как охотник'
unregister = '❌ Вы не зарегистрированы'
invalid_send_to_group = "⚠️ Не удалось отправить"
successful_send_to_group = "✅ Ваша заявка успешно отправлена!"
hunting_request_already_sent_to_group = '📨 Заявка на охоту уже отправлена'
hunt_group_confirmed = '✅ Заявка на охоту подтверждена'
no_new_messages = '📭 Нет новых сообщений'
admin_reply_on_request_new_message = ('🔔 Вы получили новое сообщение по поводу охоты. \n'
                                      'Перейдите в раздел с охотой, чтобы посмотреть')
wrong_role = '🚫 Не подходящая роль'
your_buttons = 'ℹ️ Ваши кнопки'
personal_data = '''ℹ️ Для продолжения работы в чат-боте вам нужно подтвердить своё согласие на рекламные коммуникации и обработкту своих персональных данных.

Нажимая на кнопку и продолжая общение, вы соглашаетесь на рекламные коммуникации и обработку персональных данных.

Ознакомьтесь с содержимым на cогласие на получение рекламы и с согласием на обработку персональных данных.'''

wh_main_content = '🎬 Контент Wild-Hunter.ru\nСоветуем подписаться на основной канал, чтобы ничего не пропустить'
wh_media_content = f'🌄 Отличное время для охоты! Большее можно узнать <a href="{links_texts.wh_tg_channel_link}">здесь</a>'
# =============== Регистрация охотников ===============
start_hunter_registration = '📝 Для регистрации вам необходимо заполнить форму. Для начала...'
hunter_registration_name = '👤 Введите ваше ФИО'
hunter_registration_phone_number = '📞 Введите ваш номер телефона'
hunter_registration_email = '📧 Введите вашу электронную почту (опционально)\n\nexample@...'
hunter_registration_region = '🗺️ Выберите регион охоты (Можно написать вручную)'
hunter_registration_hunting_type = '🎯 Какие виды охоты интересуют: '
hunter_registration_hunting_date = ('📅 Введите период в формате:\nгод-месяц-день   год-месяц-день\n\n'
                                    'Например: 2025-10-01   2025-12-13')
hunter_registration_comment = '💬 Вы можете оставить комментарий или пожелание'

invalid_phone_number = '⚠️ Похоже, что номер введён некорректно. Попробуйте снова.'
invalid_email = '⚠️ Похоже, что email введён некорректно. Попробуйте снова.'
invalid_date = '⚠️ Похоже, что период введён некорректно. Попробуйте снова.'
user_already_registered = 'ℹ️ Вы уже зарегистрированы'
successful_registration = '✅ Успешная регистрация'
error_registration = '⚠️ Не удалось зарегистрировать вас. Ошибка регистрации'

# =============== Регистрация охот хозяйств ===============

start_hunting_base_registration = "🏕️ Начнем регистрацию вашей базы"
hunting_base_registration_name = "🏷️ Введите название вашей базы или охотхозяйства"
hunting_base_registration_region = "🗺️ Выберите регион (Можно написать вручную)"
hunting_base_registration_services = "🧰 Опишите виды услуг, которые вы предоставляете (Можете написать свой вариант)"
hunting_base_registration_contact_person = '👤 Укажите контактное лицо.  Это может быть e-mail или телеграм'
hunting_base_registration_contact = "📞 Укажите номер телефона"
hunting_base_registration_website = "🌐 Добавьте сайт или соцсети"
no_services_selected = '⚠️ Нужно выбрать хотя бы одну услугу'
